In [278]:
import pandas as pd

In [279]:
#create dataframe from csv

salaries = pd.read_csv('salaries.csv')

In [280]:
########################
### LOOK AT THE DATA ###
########################

In [281]:
salaries.head() #first 5 observations

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,$101592.00,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,$110064.00,NaN
4,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,$36.18

In [282]:
salaries.head(n=2) #first 2 observations

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN

In [283]:
salaries.shape #how many rows and columns?

(32812, 8)

In [284]:
salaries.columns #what are the columns?

Index(['Name', 'Job Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary', 'Hourly Rate'],
      dtype='object')

In [285]:
salaries['Department'].unique() #view unique values in a column

array(['POLICE', 'GENERAL SERVICES', 'WATER MGMNT', 'TRANSPORTN', 'OEMC',
       'CITY COUNCIL', 'AVIATION', 'STREETS & SAN', 'FIRE',
       'FAMILY & SUPPORT', 'PUBLIC LIBRARY', "MAYOR'S OFFICE", 'HEALTH',
       'BUSINESS AFFAIRS', 'LAW', 'FINANCE', 'CULTURAL AFFAIRS',
       'COMMUNITY DEVELOPMENT', 'PROCUREMENT', 'BUILDINGS',
       'ANIMAL CONTRL', 'CITY CLERK', 'BOARD OF ELECTION', 'DISABILITIES',
       'HUMAN RESOURCES', 'DoIT', 'BUDGET & MGMT', 'TREASURER',
       'INSPECTOR GEN', 'IPRA', 'HUMAN RELATIONS', 'COPA',
       'BOARD OF ETHICS', 'POLICE BOARD', 'ADMIN HEARNG',
       'LICENSE APPL COMM'], dtype=object)

In [286]:
###############################
### SELECT ROWS AND COLUMNS ###
###############################

#https://chrisalbon.com/python/pandas_indexing_selecting.html

In [287]:
salaries['Job Titles'].head() #select a column

0                                  SERGEANT
1    POLICE OFFICER (ASSIGNED AS DETECTIVE)
2                  CHIEF CONTRACT EXPEDITER
3                         CIVIL ENGINEER IV
4                          CONCRETE LABORER
Name: Job Titles, dtype: object

In [288]:
salaries[['Name', 'Job Titles']].head() #select multiple columns

                  Name                              Job Titles
0    AARON,  JEFFERY M                                SERGEANT
1      AARON,  KARINA   POLICE OFFICER (ASSIGNED AS DETECTIVE)
2  AARON,  KIMBERLEI R                CHIEF CONTRACT EXPEDITER
3  ABAD JR,  VICENTE M                       CIVIL ENGINEER IV
4   ABARCA,  EMMANUEL                         CONCRETE LABORER

In [289]:
salaries.iloc[25:27] #select rows by row number

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
25,"ABERCROMBIE IV, EARL S",PARAMEDIC I/C,FIRE,F,Salary,NaN,$82614.00,NaN
26,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60

In [290]:
salaries['Annual Salary'].iloc[50:52] #combine column and row selection

50    $84420.00
51    $76266.00
Name: Annual Salary, dtype: object

In [291]:
###############
### MASKING ###
###############

#select a subset of the dataframe based on some conditional statement, 
#e.g. select rows for part-time employees

In [292]:
mask = salaries['Full or Part-Time'] == 'P'
salaries[mask].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
11,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68

In [293]:
salaries[salaries['Full or Part-Time'] == 'P'].head(n=3) #same as above

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
11,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68

In [294]:
#or: |

salaries[(salaries['Department'] == 'OEMC') | (salaries['Department'] == 'PUBLIC LIBRARY')].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68
28,"ABIOYE, ADEWOLE A",LIBRARY ASSOCIATE - HOURLY,PUBLIC LIBRARY,P,Hourly,20.0,NaN,$25.10

In [295]:
#and: &

salaries[(salaries['Department'] == 'PUBLIC LIBRARY') & (salaries['Full or Part-Time'] == 'F')].head(n=3)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
100,"ACOSTA, MARTHA A",LIBRARY ASSOCIATE,PUBLIC LIBRARY,F,Salary,NaN,$69492.00,NaN
120,"ADAMS, DEANIE M",LIBRARIAN II,PUBLIC LIBRARY,F,Salary,NaN,$65448.00,NaN
156,"ADAMS, SHERYLL A",LIBRARIAN IV,PUBLIC LIBRARY,F,Salary,NaN,$100776.00,NaN

In [296]:
#not: ~

salaries[~(salaries['Department'] == 'PUBLIC LIBRARY')].head(n=2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN

In [297]:
#same as above

salaries[salaries['Department'] != "PUBLIC LIBRARY"].head(n=2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN

In [298]:
###############################
### DEALING WITH DATA TYPES ###
###############################

In [299]:
type(salaries['Annual Salary'].iloc[0]) #check type of salary column

str

In [300]:
salaries['Annual Salary'] = salaries['Annual Salary'].str.replace('$', '') #remove dollar signs

In [301]:
salaries['Annual Salary'].head(n=2) #dollar signs are gone

0    101442.00
1     94122.00
Name: Annual Salary, dtype: object

In [302]:
type(salaries['Annual Salary'].iloc[0]) #still a string...

str

In [303]:
salaries['Annual Salary'] = salaries['Annual Salary'].apply(pd.to_numeric) #convert column to float

In [304]:
type(salaries['Annual Salary'].iloc[0]) #float!

numpy.float64

In [305]:
#now we can do math :)

mean_sal = salaries['Annual Salary'].mean() #automatically ignores NaNs
med_sal = salaries['Annual Salary'].median()
min_sal = salaries['Annual Salary'].min()
max_sal = salaries['Annual Salary'].max()
count_sal = salaries['Annual Salary'].count()

print("mean: %s, median: %s, min: %s, max: %s, count: %s" % (mean_sal, med_sal, min_sal, max_sal, count_sal))

mean: 87313.9591872, median: 90024.0, min: 12840.0, max: 300000.0, count: 24951

In [186]:
####################
### MISSING DATA ###
####################

In [187]:
salaries.isnull().head() #find NaNs

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,False,False,False,False,False,True,False,True
1,False,False,False,False,False,True,False,True
2,False,False,False,False,False,True,False,True
3,False,False,False,False,False,True,False,True
4,False,False,False,False,False,False,True,False

In [188]:
salaries['Annual Salary'] = salaries['Annual Salary'].fillna(0) #fill NaN with 0 - does this make sense for the data?
salaries['Annual Salary'].head()

0    101442.0
1     94122.0
2    101592.0
3    110064.0
4         0.0
Name: Annual Salary, dtype: float64

In [189]:
salaries = salaries.dropna() #does this make sense for the data?
salaries.shape

(7861, 8)

In [190]:
salaries = pd.read_csv('salaries.csv') #remake dataframe

In [191]:
salaries = salaries.dropna(subset = ['Typical Hours']) #drop rows that have NaNs in the Typical Hours column

In [192]:
salaries.shape

(7861, 8)

In [193]:
###########################
### JOINING AND MERGING ###
###########################

In [194]:
fruit_data = {'id': ['1', '2', '3', '4'],
        'fruit': ['Apple', 'Orange', 'Banana', 'Strawberry']}
df_fruit = pd.DataFrame(fruit_data, columns = ['id', 'fruit']) #if you don't name the columns they'll be in alphabetical order

In [195]:
df_fruit

  id       fruit
0  1       Apple
1  2      Orange
2  3      Banana
3  4  Strawberry

In [196]:
color_data = {'id': ['1', '2', '3', '4'],
        'color': ['Red', 'Orange', 'Yellow', 'Red']}
df_color = pd.DataFrame(color_data, columns = ['id', 'color'])

In [197]:
df_color

  id   color
0  1     Red
1  2  Orange
2  3  Yellow
3  4     Red

In [198]:
pd.merge(df_fruit, df_color, on='id') #merge dataframes

  id       fruit   color
0  1       Apple     Red
1  2      Orange  Orange
2  3      Banana  Yellow
3  4  Strawberry     Red

In [199]:
fruit_data_2 = {'id': ['5', '6'],
                'fruit': ['Raspberry', 'Pineapple']}
df_fruit_2 = pd.DataFrame(fruit_data_2, columns = ['id', 'fruit'])

In [200]:
df_fruit_2

  id      fruit
0  5  Raspberry
1  6  Pineapple

In [201]:
new_fruits = pd.concat([df_fruit, df_fruit_2])
new_fruits

  id       fruit
0  1       Apple
1  2      Orange
2  3      Banana
3  4  Strawberry
0  5   Raspberry
1  6   Pineapple

In [202]:
pd.merge(new_fruits, df_color, on='id', how='outer') #why is the color for the last two rows NaN?

  id       fruit   color
0  1       Apple     Red
1  2      Orange  Orange
2  3      Banana  Yellow
3  4  Strawberry     Red
4  5   Raspberry     NaN
5  6   Pineapple     NaN

In [203]:
#http://www.dofactory.com/Images/sql-joins.png

In [204]:
pd.concat([df_a, df_b], axis=1)

  id       fruit id   color
0  1       Apple  1     Red
1  2      Orange  2  Orange
2  3      Banana  3  Yellow
3  4  Strawberry  4     Red

In [205]:
df_x = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6]})
df_y = pd.DataFrame({'c': [7,8,9], 'd': [10,11,12]}) #what do these dataframes look like?

In [206]:
df_x

   a  b
0  1  4
1  2  5
2  3  6

In [207]:
df_y

   c   d
0  7  10
1  8  11
2  9  12

In [208]:
pd.concat([df_x, df_y], axis=1) #join the dataframes along columns

   a  b  c   d
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [209]:
pd.concat([df_x, df_y]) #what will this look like?

     a    b    c     d
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

In [ ]:
### OTHER HELPFUL FEATURES

In [273]:
salaries.groupby("Department").count().head()

,Name,Job Titles,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
Department,,,,,,,
ADMIN HEARNG,39,39,39,39,0,39,0
ANIMAL CONTRL,80,80,80,80,18,62,18
AVIATION,1414,1414,1414,1414,865,549,865
BOARD OF ELECTION,103,103,103,103,0,103,0
BOARD OF ETHICS,8,8,8,8,0,8,0

In [268]:
salaries.groupby("Department").median().sort_values('Annual Salary', ascending=False).head()

             Typical Hours  Annual Salary
Department
IPRA                   NaN      101592.00
BUILDINGS              NaN      100256.04
DoIT                   NaN       97056.00
FIRE                  40.0       93666.00
WATER MGMNT           40.0       92556.00

In [274]:
#common mistake: not performing operations in place

salaries.dropna() #performs the operation but doesn't save the results

Empty DataFrame
Columns: [Name, Job Titles, Department, Full or Part-Time, Salary or Hourly, Typical Hours, Annual Salary, Hourly Rate]
Index: []

In [275]:
salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,$36.18
5,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86
6,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,NaN,50436.0,NaN
7,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,$46.10
8,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60
9,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,F,Salary,NaN,103350.0,NaN
10,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65
12,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
13,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
14,"ABDELLATIF, AREF R",FIREFIGHTER (PER ARBITRATORS AWARD)-PARAMEDIC,FIRE,F,Salary,NaN,102228.0,NaN
15,"ABDELMAJEID, AZIZ",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
16,"ABDOLLAHZADEH, ALI",FIREFIGHTER/PARAMEDIC,FIRE,F,Salary,NaN,91272.0,NaN
17,"ABDUL-KARIM, MUHAMMAD A",ENGINEERING TECHNICIAN VI,WATER MGMNT,F,Salary,NaN,111492.0,NaN
18,"ABDULLAH, DANIEL N",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,95484.0,NaN
19,"ABDULLAH, KEVIN",LIEUTENANT,FIRE,F,Salary,NaN,114846.0,NaN
20,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68
21,"ABDULLAH, RASHAD",ELECTRICAL MECHANIC-AUTO-POLICE MTR MNT,GENERAL SERVICES,F,Hourly,40.0,NaN,$46.10
22,"ABDULSATTAR, MUDHAR",CIVIL ENGINEER II,WATER MGMNT,F,Salary,NaN,63480.0,NaN
23,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$20.77
24,"ABEJERO, JASON V",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
25,"ABERCROMBIE IV, EARL S",PARAMEDIC I/C,FIRE,F,Salary,NaN,82614.0,NaN
26,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60
27,"ABFALL, RICHARD C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
28,"ABIOYE, ADEWOLE A",LIBRARY ASSOCIATE - HOURLY,PUBLIC LIBRARY,P,Hourly,20.0,NaN,$25.10
29,"ABNEY, PATRICK",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
...,...,...,...,...,...,...,...,...
32782,"ZUNIGA, JURDON",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
32783,"ZUNIGA, NOE",POLICE OFFICER,POLICE,F,Salary,NaN,68616.0,NaN
32784,"ZUNIGA, OSCAR",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
32785,"ZUNIGA, RONALD",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
32786,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$22.12
32787,"ZUNIGA, VICENTE",FIREFIGHTER-EMT,FIRE,F,Salary,NaN,92274.0,NaN
32788,"ZUPAN, BILL M",LIEUTENANT-EMT,FIRE,F,Salary,NaN,114324.0,NaN
32789,"ZUPANCIC, KELLY",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
32790,"ZURAWSKI, JEFFREY",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85
32791,"ZURAWSKI, MAC Z",REFUSE COLLECTION COORD,STREETS & SAN,F,Salary,NaN,76896.0,NaN
32792,"ZURAWSKI, MARY E",POLICE OFFICER,POLICE,F,Salary,NaN,96060.0,NaN
32793,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,$46.10
32794,"ZUREK, MARY H",SENIOR PUBLIC INFORMATION OFFICER,FINANCE,F,Salary,NaN,89076.0,NaN
32795,"ZURITA, ADRIEL",POLICE OFFICER,POLICE,F,Salary,NaN,76266.0,NaN
32796,"ZVANJA, TINA M",LEGAL SECRETARY,LAW,F,Salary,NaN,76932.0,NaN
32797,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68
32798,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,$35.60
32799,"ZWIT, JEFFREY J",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
32800,"ZWOLFER, MATTHEW W",LIEUTENANT-EMT,FIRE,F,Salary,NaN,114324.0,NaN
32801,"ZYCH, MATEUSZ",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
32802,"ZYDEK, BRYAN",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
32803,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,$46.35
32804,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85
32805,"ZYGMUNT, ARTUR",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
32806,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
32807,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
32808,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
32809,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
32810,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
32811,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

In [326]:
salaries = salaries.dropna() #or: salaries.dropna(inplace=True)

In [327]:
salaries

Empty DataFrame
Columns: [Name, Job Titles, Department, Full or Part-Time, Salary or Hourly, Typical Hours, Annual Salary, Hourly Rate]
Index: []

In [329]:
salaries = pd.read_csv('salaries.csv') #recreate dataframe

In [330]:
salaries['Typical Hours'].dropna().head() #drop NaNs

4     40.0
5     20.0
7     40.0
8     40.0
11    20.0
Name: Typical Hours, dtype: float64

In [331]:
salaries['Typical Hours'].head() #NaNs are back

0     NaN
1     NaN
2     NaN
3     NaN
4    40.0
Name: Typical Hours, dtype: float64

In [332]:
salaries['Typical Hours'].dropna(inplace=True) #drop NaNs inplace

In [333]:
salaries['Typical Hours'].head() #NaNs are gone

4     40.0
5     20.0
7     40.0
8     40.0
11    20.0
Name: Typical Hours, dtype: float64

In [338]:
salaries = pd.read_csv('salaries.csv') #recreate dataframe

In [339]:
salaries['Typical Hours'].head()

0     NaN
1     NaN
2     NaN
3     NaN
4    40.0
Name: Typical Hours, dtype: float64

In [340]:
salaries['Typical Hours'] / 10

0        NaN
1        NaN
2        NaN
3        NaN
4        4.0
5        2.0
6        NaN
7        4.0
8        4.0
9        NaN
10       NaN
11       2.0
12       NaN
13       NaN
14       NaN
15       NaN
16       NaN
17       NaN
18       NaN
19       NaN
20       2.0
21       4.0
22       NaN
23       4.0
24       NaN
25       NaN
26       4.0
27       NaN
28       2.0
29       NaN
        ...
32782    NaN
32783    NaN
32784    NaN
32785    NaN
32786    4.0
32787    NaN
32788    NaN
32789    NaN
32790    4.0
32791    NaN
32792    NaN
32793    4.0
32794    NaN
32795    NaN
32796    NaN
32797    2.0
32798    4.0
32799    NaN
32800    NaN
32801    NaN
32802    NaN
32803    4.0
32804    4.0
32805    NaN
32806    NaN
32807    NaN
32808    NaN
32809    NaN
32810    NaN
32811    NaN
Name: Typical Hours, dtype: float64

In [343]:
salaries['Typical Hours'].head() #division by 10 didn't stick

0     NaN
1     NaN
2     NaN
3     NaN
4    40.0
Name: Typical Hours, dtype: float64

In [344]:
salaries['Typical Hours'] = salaries['Typical Hours'] / 10

In [345]:
salaries['Typical Hours'].head(n=5) #division by 10 stuck

0    NaN
1    NaN
2    NaN
3    NaN
4    4.0
Name: Typical Hours, dtype: float64